modm-ext/data.modm.io/docs/svd/header_stm32u575xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <description>IWDG</description>
      <groupName>IWDG</groupName>
      <baseAddress>0x40003000</baseAddress>
      <interrupt>
        <name>IWDG</name>
        <description>IWDG global interrupt</description>
        <value>27</value>
      </interrupt>
      <registers>
        <register>
          <name>KR</name>
          <description>IWDG Key register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key value (write only, read 0000h)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>IWDG Prescaler register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PR</name>
              <description>PR[3:0] (Prescaler divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <description>IWDG Reload register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RL</name>
              <description>Watchdog counter reload value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>IWDG Status register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PVU</name>
              <description>Watchdog prescaler value update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RVU</name>
              <description>Watchdog counter reload value update</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WVU</name>
              <description>Watchdog counter window value update</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWU</name>
              <description>Watchdog interrupt comparator value update</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWIF</name>
              <description>Watchdog early interrupt flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WINR</name>
          <description>IWDG Window register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WIN</name>
              <description>Watchdog counter window value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EWCR</name>
          <description>IWDG Early Wakeup register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EWIT</name>
              <description>Watchdog early wakeup comparator value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>EWIC</name>
              <description>Watchdog early wakeup comparator value</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWIE</name>
              <description>Watchdog early wakeup comparator value</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI2</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global interrupt</description>
        <value>60</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>SPI/I2S Control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPE</name>
              <description>Serial Peripheral Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MASRX</name>
              <description>Master automatic SUSP in Receive mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSTART</name>
              <description>Master transfer start</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSUSP</name>
              <description>Master SUSPend request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDDIR</name>
              <description>Rx/Tx direction at Half-duplex mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSI</name>
              <description>Internal SS signal input level</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC33_17</name>
              <description>32-bit CRC polynomial configuration</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCRCINI</name>
              <description>CRC init pattern control for receiver</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO_PATTERN</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONES_PATTERN</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCRCINI</name>
              <description>CRC init pattern control for transmitter</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO_PATTERN</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONES_PATTERN</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOLOCK</name>
              <description>Locking the AF configuration of associated IOs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>SPI Control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TSIZE</name>
              <description>Number of data at current transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG1</name>
          <description>SPI Configuration register 1</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSIZE</name>
              <description>DSIZE[4:0]: Bits number in single SPI data frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATAWIDTH_4BIT</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_5BIT</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_6BIT</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_7BIT</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_8BIT</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_9BIT</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_10BIT</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_11BIT</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_12BIT</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_13BIT</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_14BIT</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_15BIT</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_16BIT</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_17BIT</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_18BIT</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_19BIT</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_20BIT</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_21BIT</name>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_22BIT</name>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_23BIT</name>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_24BIT</name>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_25BIT</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_26BIT</name>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_27BIT</name>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_28BIT</name>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_29BIT</name>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_30BIT</name>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_31BIT</name>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_32BIT</name>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTHLV</name>
              <description>FTHVL [3:0]: FIFO threshold level</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TH_01DATA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_02DATA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_03DATA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_04DATA</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_05DATA</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_06DATA</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_07DATA</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_08DATA</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_09DATA</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_10DATA</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_11DATA</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_12DATA</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_13DATA</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_14DATA</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_15DATA</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_16DATA</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UDRCFG</name>
              <description>Behavior of Slave transmitter at underrun</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGISTER_PATTERN</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST_RECEIVED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>Rx DMA stream enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>Tx DMA stream enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCSIZE</name>
              <description>CRCSIZE [4:0]: Length of CRC frame</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_4BIT</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_5BIT</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_6BIT</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_7BIT</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_8BIT</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_9BIT</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_10BIT</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_11BIT</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_12BIT</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_13BIT</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_14BIT</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_15BIT</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_16BIT</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_17BIT</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_18BIT</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_19BIT</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_20BIT</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_21BIT</name>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_22BIT</name>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_23BIT</name>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_24BIT</name>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_25BIT</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_26BIT</name>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_27BIT</name>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_28BIT</name>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_29BIT</name>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_30BIT</name>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_31BIT</name>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_32BIT</name>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCEN</name>
              <description>Hardware CRC computation enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBR</name>
              <description>Master baud rate</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BPASS</name>
              <description>Bypass of the prescaler</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
