modm-ext/data.modm.io/docs/svd/header_stm32u575xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OPAMP1</name>
      <description>Operational Amplifier (OPAMP)</description>
      <groupName>OPAMP</groupName>
      <alternatePeripheral>OPAMP12_COMMON</alternatePeripheral>
      <baseAddress>0x46005000</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>OPAMP control/status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OPAEN</name>
              <description>OPAMP enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPALPM</name>
              <description>Operational amplifier Low Power Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAMODE</name>
              <description>Operational amplifier PGA mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDALONE</name>
                  <description>OPAMP functional mode, OPAMP operation in standalone</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOLLOWER</name>
                  <description>OPAMP functional mode, OPAMP operation in follower</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGA</name>
                  <description>OPAMP functional mode, OPAMP operation in PGA</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGA_GAIN</name>
              <description>Operational amplifier Programmable amplifier gain value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAIN_2</name>
                  <description>OPAMP PGA gain 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_4</name>
                  <description>OPAMP PGA gain 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_8</name>
                  <description>OPAMP PGA gain 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_16</name>
                  <description>OPAMP PGA gain 16</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VM_SEL</name>
              <description>Inverting input selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IO0</name>
                  <description>OPAMP inverting input connected to GPIO pin (valid also in PGA mode for filtering). Note: OPAMP inverting input is used with OPAMP in mode standalone or PGA with external capacitors for filtering circuit. Otherwise (OPAMP in mode follower), OPAMP inverting input is not used (not connected to GPIO pin).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>OPAMP inverting input (low leakage input) connected to GPIO pin (available only on package BGA132). Note: OPAMP inverting input is used with OPAMP in mode standalone or PGA with external capacitors for filtering circuit. Otherwise (OPAMP in mode follower), OPAMP inverting input is not used (not connected to GPIO pin).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONNECT_NO</name>
                  <description>OPAMP inverting input not externally connected (intended for OPAMP in mode follower or PGA without external capacitors for filtering)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VP_SEL</name>
              <description>Non inverted input selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IO0</name>
                  <description>OPAMP non inverting input connected to GPIO pin (pin PA0 for OPAMP1, pin PA6 for OPAMP2)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>OPAMP non inverting input connected to DAC1 channel output(channel1 for OPAMP1, channel2 for OPAMP2)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALON</name>
              <description>Calibration mode enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FUNCTIONAL</name>
                  <description>OPAMP functional mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CALIBRATION</name>
                  <description>OPAMP calibration mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALSEL</name>
              <description>Calibration selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USERTRIM</name>
              <description>User trimming enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FACTORY</name>
                  <description>OPAMP trimming factors set to factory values</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER</name>
                  <description>OPAMP trimming factors set to user values</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALOUT</name>
              <description>Operational amplifier calibration output</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSM</name>
              <description>Operational amplifier high speed mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPARANGE</name>
              <description>Operational amplifier range setting</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Power supply range low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Power supply range high - recommended for performance purpose</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OTR</name>
          <description>OPAMP</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRIMOFFSETN</name>
              <description>Trim for NMOS differential pairs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRIMOFFSETP</name>
              <description>Trim for PMOS differential pairs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LPOTR</name>
          <description>OPAMP</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRIMLPOFFSETN</name>
              <description>Trim for NMOS differential pairs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRIMLPOFFSETP</name>
              <description>Trim for PMOS differential pairs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
